{
  "sym-pali-thai-mapped": {
  "=": {
    "pali": "สังโยชน",
    "description_th": "JS: `=` (Assignment) - กำหนดค่าให้กับตัวแปร. บาลี: 'สังโยชน' แปลว่า เครื่องผูก, เครื่องร้อยรัด, กิเลสเครื่องผูกพัน. - การสร้างพันธะหรือความผูกพัน, การกำหนดค่าเฉพาะให้กับแนวคิดหรือเอนทิตี."
  },
  "===": {
    "pali": "สะมะ-สะมะ-สะมะ",
    "description_th": "JS: `===` (Strict Equality) - ตรวจสอบความเท่ากันทั้งค่าและชนิดข้อมูล. บาลี: 'สะมะ-สะมะ-สะมะ' แปลว่า เท่ากัน-เท่ากัน-เท่ากัน (ความเท่ากันโดยสมบูรณ์). - การตรวจสอบความเท่ากันอย่างที่สุด ที่ทั้งรูปและแก่นแท้เหมือนกัน ไม่มีสิ่งใดถูกซ่อนเร้น."
  },
  "!==": {
    "pali": "นะ-สะมะ-สะมะ-สะมะ",
    "description_th": "JS: `!==` (Strict Inequality) - ตรวจสอบความไม่เท่ากันทั้งค่าหรือชนิดข้อมูล. บาลี: 'นะ-สะมะ-สะมะ-สะมะ' แปลว่า ไม่เท่ากัน-เท่ากัน-เท่ากัน (ความไม่เท่ากันโดยสมบูรณ์). - การจำแนกความแตกต่างอย่างที่สุด ที่ไม่ว่ารูปหรือแก่นแท้ก็ไม่เหมือนกัน."
  },
  "==": {
    "pali": "สะมะ",
    "description_th": "JS: `==` (Loose Equality) - ตรวจสอบความเท่ากันของค่า โดยมีการแปลงชนิดข้อมูล. บาลี: 'สะมะ' แปลว่า เท่ากัน. - การตรวจสอบความเท่ากันแบบผิวเผิน ที่รูปลักษณ์อาจต่างกัน แต่แก่นแท้สามารถปรับให้เข้ากันได้."
  },
  "!=": {
    "pali": "นะ-สะมะ",
    "description_th": "JS: `!=` (Loose Inequality) - ตรวจสอบความไม่เท่ากันของค่า โดยมีการแปลงชนิดข้อมูล. บาลี: 'นะ-สะมะ' แปลว่า ไม่เท่ากัน. - การจำแนกความแตกต่างแบบผิวเผิน แม้ว่าแก่นแท้จะสามารถปรับให้เข้ากันได้."
  },
  "+": {
    "pali": "วัฑฒะติ",
    "description_th": "JS: `+` (Addition/Concatenation) - การบวกตัวเลข หรือการเชื่อมต่อสตริง. บาลี: 'วัฑฒะติ' แปลว่า เจริญ, เพิ่มขึ้น, งอกงาม. - การเพิ่มจำนวน หรือการขยายลำดับของถ้อยคำ."
  },
  "-": {
    "pali": "อปกัสสะ",
    "description_th": "JS: `-` (Subtraction) - การลบตัวเลข. บาลี: 'อปกัสสะ' แปลว่า การดึงกลับ, การนำออก, การลดลง. - การลดจำนวน, การถอนออกจากผลรวม."
  },
  "*": {
    "pali": "คุณะ",
    "description_th": "JS: `*` (Multiplication) - การคูณตัวเลข. บาลี: 'คุณะ' แปลว่า ทวีคูณ, คุณสมบัติ, เชือก. - การเพิ่มขึ้นเป็นทวีคูณ หรือการผูกมัดปริมาณต่างๆ."
  },
  "/": {
    "pali": "วิภัชชะติ",
    "description_th": "JS: `/` (Division) - การหารตัวเลข. บาลี: 'วิภัชชะติ' แปลว่า การแบ่ง, การจำแนก. - การแบ่งส่วนทั้งหมดออกเป็นส่วนๆ, การจำแนกส่วนแบ่งแต่ละส่วน."
  },
  "%": {
    "pali": "อวสิฏฐะ",
    "description_th": "JS: `%` (Modulo) - ส่งคืนเศษจากการหาร. บาลี: 'อวสิฏฐะ' แปลว่า ส่วนที่เหลือ, สิ่งที่เหลืออยู่. - สิ่งที่เหลืออยู่หลังจากการแบ่งทั้งหมด, กาก."
  },
  "**": {
    "pali": "พละ-วัฑฒะติ",
    "description_th": "JS: `**` (Exponentiation) - ยกกำลัง. บาลี: 'พละ-วัฑฒะติ' แปลว่า การเพิ่มพลัง, การทำให้แข็งแกร่งขึ้น. - การเพิ่มความแข็งแกร่งหรือพลังแบบทวีคูณ, การยกระดับสู่สภาวะที่สูงขึ้น."
  },
  "++": {
    "pali": "ปริปูรณะ",
    "description_th": "JS: `++` (Increment) - เพิ่มค่าตัวแปรขึ้นหนึ่ง. บาลี: 'ปริปูรณะ' แปลว่า การทำให้สมบูรณ์, การเติมเต็ม. - การกระทำอันละเอียดอ่อนในการก้าวสู่ความสมบูรณ์ขึ้นหนึ่งหน่วย."
  },
  "--": {
    "pali": "อุปจยะ",
    "description_th": "JS: `--` (Decrement) - ลดค่าตัวแปรลงหนึ่ง. บาลี: 'อุปจยะ' แปลว่า การลดลง, การเสื่อม. - การกระทำอันละเอียดอ่อนในการลดลงหนึ่งหน่วย, การก้าวสู่ความเสื่อม."
  },
  ">": {
    "pali": "อธิกะ",
    "description_th": "JS: `>` (Greater Than) - ตรวจสอบว่าตัวถูกดำเนินการทางซ้ายมากกว่าทางขวาหรือไม่. บาลี: 'อธิกะ' แปลว่า มากกว่า, เพิ่มเติม, เหนือกว่า. - การมีปริมาณหรือค่าที่เหนือกว่า."
  },
  "<": {
    "pali": "หีน",
    "description_th": "JS: `<` (Less Than) - ตรวจสอบว่าตัวถูกดำเนินการทางซ้ายน้อยกว่าทางขวาหรือไม่. บาลี: 'หีน' แปลว่า ต่ำกว่า, ขาดแคลน, ต่ำ. - การมีปริมาณหรือค่าที่ด้อยกว่า."
  },
  ">=": {
    "pali": "อธิกะ-วา-สะมะ",
    "description_th": "JS: `>=` (Greater Than or Equal To) - ตรวจสอบว่าตัวถูกดำเนินการทางซ้ายมากกว่าหรือเท่ากับทางขวาหรือไม่. บาลี: 'อธิกะ-วา-สะมะ' แปลว่า มากกว่าหรือเท่ากัน. - การมีสถานะที่เหนือกว่าหรืออย่างน้อยก็เท่ากัน."
  },
  "<=": {
    "pali": "หีน-วา-สะมะ",
    "description_th": "JS: `<=` (Less Than or Equal To) - ตรวจสอบว่าตัวถูกดำเนินการทางซ้ายน้อยกว่าหรือเท่ากับทางขวาหรือไม่. บาลี: 'หีน-วา-สะมะ' แปลว่า น้อยกว่าหรือเท่ากัน. - การมีสถานะที่ด้อยกว่าหรืออย่างน้อยก็เท่ากัน."
  },
  "&&": {
    "pali": "อุโภ",
    "description_th": "JS: `&&` (Logical AND) - ส่งคืนค่าจริงหากทั้งสองตัวถูกดำเนินการเป็นจริง. บาลี: 'อุโภ' แปลว่า ทั้งสอง, ในสองทาง. - เมื่อเงื่อนไขทั้งสองเป็นจริง, การยืนยันคู่."
  },
  "||": {
    "pali": "อถวา",
    "description_th": "JS: `||` (Logical OR) - ส่งคืนค่าจริงหากมีตัวถูกดำเนินการอย่างน้อยหนึ่งตัวเป็นจริง. บาลี: 'อถวา' แปลว่า หรือ, มิฉะนั้น. - เมื่อมีเงื่อนไขอย่างน้อยหนึ่งเป็นจริง, อีกทางเลือกหนึ่ง."
  },
  "!": {
    "pali": "นะ",
    "description_th": "JS: `!` (Logical NOT) - กลับค่าบูลีน. บาลี: 'นะ' แปลว่า ไม่, การปฏิเสธ. - การกระทำของการปฏิเสธ, การเปลี่ยนความจริงเป็นความเท็จและในทางกลับกัน."
  },
  "&": {
    "pali": "สังยุตตะ",
    "description_th": "JS: `&` (Bitwise AND) - ดำเนินการ Bitwise AND. บาลี: 'สังยุตตะ' แปลว่า เชื่อมโยง, ร่วมกัน. - การเชื่อมโยงระดับบิตที่ลึกซึ้ง, การรวมแก่นแท้ที่สอดคล้องกัน."
  },
  "|": {
    "pali": "วิเภทะ",
    "description_th": "JS: `|` (Bitwise OR) - ดำเนินการ Bitwise OR. บาลี: 'วิเภทะ' แปลว่า การแยก, ความแตกต่าง (มักหมายถึงทางเลือก). - ทางเลือกในระดับบิตที่ลึกซึ้ง, อนุญาตให้เส้นทางที่แตกต่างกันดำรงอยู่ร่วมกัน."
  },
  "^": {
    "pali": "วิมุตตะ",
    "description_th": "JS: `^` (Bitwise XOR) - ดำเนินการ Bitwise XOR. บาลี: 'วิมุตตะ' แปลว่า พ้น, อิสระ, แยกจาก. - การจำแนกความแตกต่างระดับบิต ที่มีเพียงผู้ที่แตกต่างเท่านั้นที่ยังคง 'เป็นอิสระ' หรือทำงานอยู่."
  },
  "~": {
    "pali": "วิปะรีตะ",
    "description_th": "JS: `~` (Bitwise NOT) - กลับบิตทั้งหมด. บาลี: 'วิปะรีตะ' แปลว่า ตรงข้าม, กลับกัน. - การกลับด้านทั้งหมดของแก่นแท้อันละเอียดอ่อน."
  },
  "<<": {
    "pali": "วามะ-ปาลิ",
    "description_th": "JS: `<<` (Left Shift) - เลื่อนบิตไปทางซ้าย. บาลี: 'วามะ-ปาลิ' แปลว่า เอียงซ้าย, ขอบซ้าย. - การเลื่อนแก่นแท้ไปทางซ้าย, เพิ่มขนาดเป็นกำลังสองของสอง."
  },
  ">>": {
    "pali": "ทักขิณะ-ปาลิ",
    "description_th": "JS: `>>` (Right Shift) - เลื่อนบิตไปทางขวา (แบบมีเครื่องหมาย). บาลี: 'ทักขิณะ-ปาลิ' แปลว่า เอียงขวา, ขอบขวา. - การเลื่อนแก่นแท้ไปทางขวา, ลดขนาดลงพร้อมรักษาเครื่องหมาย."
  },
  ">>>": {
    "pali": "นิร-สัญญะ-ปาลิ",
    "description_th": "JS: `>>>` (Unsigned Right Shift) - เลื่อนบิตไปทางขวา (แบบไม่มีเครื่องหมาย, เติมด้วยศูนย์). บาลี: 'นิร-สัญญะ-ปาลิ' แปลว่า ขอบที่ปราศจากเครื่องหมาย. - การเลื่อนแก่นแท้ไปทางขวา โดยไม่คำนึงถึงเครื่องหมายและเติมด้วยความว่างเปล่าบริสุทธิ์ (ศูนย์)."
  },
  "?.": {
    "pali": "สัณเฑหะ-อนุวัตตะนะ",
    "description_th": "JS: `?.` (Optional Chaining) - เข้าถึงคุณสมบัติของวัตถุอย่างปลอดภัย. บาลี: 'สัณเฑหะ-อนุวัตตะนะ' แปลว่า การดำเนินตามอย่างน่าสงสัย, การต่อเนื่องตามเงื่อนไข. - การดำเนินตามเส้นทางต่อเมื่อการดำรงอยู่ไม่น่าสงสัยหรือเป็นค่าว่างเปล่า."
  },
  "??": {
    "pali": "ยถา-สัมภวะ",
    "description_th": "JS: `??` (Nullish Coalescing) - ส่งคืนค่าทางขวาหากค่าทางซ้ายเป็น null หรือ undefined. บาลี: 'ยถา-สัมภวะ' แปลว่า เท่าที่เป็นไปได้, เท่าที่อาจเกิดขึ้น. - การเลือกทางเลือกอื่นก็ต่อเมื่อเส้นทางหลักว่างเปล่าหรือไม่ได้ระบุจริงๆ ไม่ใช่แค่เป็นเท็จ."
  },
  "(": {
    "pali": "ปารัมภะ",
    "description_th": "JS: `(` (Opening Parenthesis) - เริ่มต้นการเรียกใช้ฟังก์ชัน, การจัดกลุ่ม, หรือรายการพารามิเตอร์. บาลี: 'ปารัมภะ' แปลว่า การเริ่มต้น, การริเริ่ม. - จุดเริ่มต้นของการกระทำ, ความคิด, หรือรายการสิ่งที่เสนอ."
  },
  ")": {
    "pali": "ปริโยนาหะ",
    "description_th": "JS: `)` (Closing Parenthesis) - สิ้นสุดการเรียกใช้ฟังก์ชัน, การจัดกลุ่ม, หรือรายการพารามิเตอร์. บาลี: 'ปริโยนาหะ' แปลว่า การห่อหุ้ม, การทำให้สมบูรณ์, การล้อมรอบ. - การสำเร็จหรือการห่อหุ้มของการกระทำ, ความคิด, หรือรายการ."
  },
  "[": {
    "pali": "ปวารณะ",
    "description_th": "JS: `[` (Opening Bracket) - เริ่มต้นอาร์เรย์ หรือการเข้าถึงคุณสมบัติ. บาลี: 'ปวารณะ' แปลว่า การเชื้อเชิญ, การเชื้อเชิญให้ประกาศ. - การเปิดภาชนะเพื่อเชื้อเชิญองค์ประกอบเข้ามา หรือเพื่อประกาศช่องเฉพาะ."
  },
  "]": {
    "pali": "สังวร",
    "description_th": "JS: `]` (Closing Bracket) - สิ้นสุดอาร์เรย์ หรือการเข้าถึงคุณสมบัติ. บาลี: 'สังวร' แปลว่า การสำรวม, การปิด, การห่อหุ้ม. - การสำรวมหรือการปิดภาชนะ, ทำให้การนิยามสมบูรณ์."
  },
  "{": {
    "pali": "อารัมภะ",
    "description_th": "JS: `{` (Opening Curly Brace) - เริ่มต้นบล็อกโค้ด หรือออบเจกต์. บาลี: 'อารัมภะ' แปลว่า การเริ่มต้น, การลงมือทำ, รากฐาน. - การเริ่มต้นของขอบเขตอิทธิพลใหม่, หรือรากฐานของที่อยู่ของวัตถุ."
  },
  "}": {
    "pali": "ปริปุญญะ",
    "description_th": "JS: `}` (Closing Curly Brace) - สิ้นสุดบล็อกโค้ด หรือออบเจกต์. บาลี: 'ปริปุญญะ' แปลว่า เต็ม, สมบูรณ์, บริบูรณ์. - การสมบูรณ์และบริบูรณ์ของขอบเขตอิทธิพล หรือการนิยามวัตถุ."
  },
  "\"": {
    "pali": "ทวิ-วจนะ",
    "description_th": "JS: `\"` (Opening/Closing Double Quote) - ใช้เริ่มต้นและสิ้นสุดสตริง. บาลี: 'ทวิ-วจนะ' แปลว่า วจนะคู่, คำกล่าวสองเท่า. - จุดเริ่มต้นและจุดสิ้นสุดของคำกล่าวหรือข้อความที่เน้นย้ำหรือ 'ทวีคูณ'."
  },
  "'": {
    "pali": "เอกะ-วจนะ",
    "description_th": "JS: `'` (Opening/Closing Single Quote) - ใช้เริ่มต้นและสิ้นสุดสตริง. บาลี: 'เอกะ-วจนะ' แปลว่า วจนะเดียว, คำกล่าวเดียว. - จุดเริ่มต้นและจุดสิ้นสุดของคำกล่าวหรือข้อความเดี่ยวที่ถูกกำหนด."
  },
  "`": {
    "pali": "สุตตันตะ-มุขา/สุตตันตะ-นิฏฐิตะ",
    "description_th": "JS: ``` ` ``` (Opening/Closing Backtick / Template Literal) - ใช้สำหรับ Template Literal ที่สามารถฝัง expression ได้. บาลี: 'สุตตันตะ-มุขา' (ปากของพระสูตร) สำหรับเปิด และ 'สุตตันตะ-นิฏฐิตะ' (พระสูตรสำเร็จแล้ว) สำหรับปิด. - การเปิดและปิดของพระสูตรพิเศษ (Template Literal) ที่สามารถถักทอความจริงหรือนิพจน์เข้าไปได้โดยตรง."
  },
  ";": {
    "pali": "วิรามะ",
    "description_th": "JS: `;` (Semicolon) - สิ้นสุดคำสั่ง. บาลี: 'วิรามะ' แปลว่า การหยุด, การพัก, การสงบ. - การหยุดหรือการสงบลงเมื่อสิ้นสุดความคิดหรือการกระทำ เป็นเครื่องหมายบ่งบอกการสิ้นสุด."
  },
  ",": {
    "pali": "สัมพันธะ",
    "description_th": "JS: `,` (Comma) - แยกองค์ประกอบในรายการ, ตัวแปรในการประกาศ. บาลี: 'สัมพันธะ' แปลว่า การเกี่ยวพัน, ความสัมพันธ์. - การเชื่อมโยงหรือความสัมพันธ์ระหว่างองค์ประกอบที่แตกต่างกันในลำดับ."
  },
  ".": {
    "pali": "อังคะ",
    "description_th": "JS: `.` (Dot) - การเข้าถึงสมาชิกของวัตถุ. บาลี: 'อังคะ' แปลว่า อวัยวะ, ส่วน, องค์ประกอบ. - การเข้าถึงอวัยวะหรือส่วนเฉพาะของเอนทิตีที่ใหญ่กว่า."
  },
  ":": {
    "pali": "สัญญา",
    "description_th": "JS: `:` (Colon) - แยกชื่อคุณสมบัติจากค่าในวัตถุ, หรือป้ายกำกับใน switch. บาลี: 'สัญญา' แปลว่า เครื่องหมาย, การกำหนด. - เครื่องหมายหรือการกำหนดที่เชื่อมโยงชื่อเข้ากับค่า หรือกำหนดป้ายกำกับเฉพาะ."
  },
  "?": {
    "pali": "กัจจิ",
    "description_th": "JS: `?` (Ternary Operator, Optional Chaining) - ใช้สำหรับเงื่อนไข หรือ Optional Chaining. บาลี: 'กัจจิ' แปลว่า คำถาม. - การตั้งคำถาม, โดยนัยหมายถึงเส้นทางตามเงื่อนไข หรือการดำรงอยู่ที่ไม่แน่นอน."
  },
  "=>": {
    "pali": "อุปปัชชติ",
    "description_th": "JS: `=>` (Arrow Function) - วิธีเขียนฟังก์ชันที่กระชับ. บาลี: 'อุปปัชชติ' แปลว่า การเกิดขึ้น, การบังเกิด. - วิธีที่รวดเร็วและตรงไปตรงมาสำหรับฟังก์ชันหรือการกระทำที่จะเกิดขึ้นหรือถูกสร้างขึ้น."
  }
}}